In [3]:
import pandas as pd
import numpy as np

### 1.如何获取两个series元素相等的index？

**输入：**

In [9]:
# Input
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 5),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 5)})
df

   fruit1  fruit2
0   apple  banana
1   apple  banana
2  banana  banana
3  banana  banana
4  orange  orange

**答案：**

In [10]:
# 方法一：
np.where(df.fruit1 == df.fruit2)

(array([2, 3, 4]),)

In [11]:
# 方法二：
(df.fruit1 == df.fruit2).to_numpy().nonzero()

(array([2, 3, 4]),)

### 2.如何将dataframe的某一列上下移动？

In [14]:
# Input
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

# Solution
df['a_lag1'] = df['a'].shift(1)
df['b_lead1'] = df['b'].shift(-1)
print(df)

    a   b   c   d  a_lag1  b_lead1
0  51  79  63  96     NaN     76.0
1  25  76  72   4    51.0     17.0
2  55  17  93  47    25.0     52.0
3  82  52  16  95    55.0     47.0
4  56  47  71  95    82.0      NaN

### 3. 如何将一列拆分成多列？

**输入：**

In [22]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    WestBengal",
"44, Chennai    TamilNadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

df

                          row
0          STD, City    State
1   33, Kolkata    WestBengal
2    44, Chennai    TamilNadu
3  40, Hyderabad    Telengana
4  80, Bangalore    Karnataka

**期望输出：**

0 STD        City        State
1  33     Kolkata  WestBengal
2  44     Chennai   TamilNadu
3  40   Hyderabad    Telengana
4  80   Bangalore    Karnataka

**答案：**

In [23]:
df_out = df.row.str.split(',|\s+', expand=True)


new_header = df_out.iloc[0]
df_out = df_out[1:]
df_out.columns = new_header
df_out

0 STD         City       State
1  33      Kolkata  WestBengal
2  44      Chennai   TamilNadu
3  40    Hyderabad   Telengana
4  80    Bangalore   Karnataka